In [1]:
import pandas as pd
import numpy as np

In [34]:
df = pd.read_csv('books_clean.csv')

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6810 entries, 0 to 6809
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           6810 non-null   object
 1   subtitle        6810 non-null   object
 2   authors         6810 non-null   object
 3   categories      6810 non-null   object
 4   description     6810 non-null   object
 5   average_rating  6810 non-null   float64
 6   ratings_count   6810 non-null   float64
 7   year            6810 non-null   int64
dtypes: float64(2), int64(1), object(5)
memory usage: 425.8+ KB

# IDENTIFICAMOS LOS CAMPOS QUE VAMOS A USAR

### title

In [75]:
# books mas antiguos, top 10
df.groupby('year')['title'].sum().head(10).reset_index()

   year                                              title
0  1853                                ... The Circulation
1  1870                        20000 LEAGUES UNDER THE SEA
2  1876  The Letters of John and Abigail AdamsDaniel De...
3  1901                       Aristophanes: The Acharnians
4  1904                          Johnny Reb and Billy Yank
5  1914                 Plato, with an English Translation
6  1925                              HieroThe Great Gatsby
7  1926                        The Murder of Roger Ackroyd
8  1927                                  To the Lighthouse
9  1928                      The Mystery of the Blue Train

In [170]:
# Cantidad de libros por a√±o top 10
df.groupby('year')['title'].count().sort_values(ascending=False).head(10).reset_index()

   year  title
0  2006    894
1  2005    691
2  2004    618
3  2003    580
4  2002    481
5  2001    395
6  2000    357
7  1999    273
8  1998    271
9  2007    267

In [169]:
# Libros mejor calificados
df.groupby('title')['average_rating'].mean().sort_values(ascending=False).head(10).reset_index()

                             title  average_rating
0  The Complete Theory Fun Factory             5.0
1     The Diamond Color Meditation             5.0
2              The Irish Anatomist             5.0
3             Ecuador Nature Guide             5.0
4                Fanning the Flame             5.0
5                Middlesex Borough             5.0
6                         Insights             5.0
7                       Lake Orion             5.0
8          Colossians and Philemon             5.0
9                       Bill Gates             5.0

In [146]:
# Obtener los 10 libros mas votados
top_rated_books = df.sort_values(by='ratings_count', ascending=False)[['title', 'ratings_count']].head(10)
top_rated_books.reset_index()

   index                                              title  ratings_count
0   2698     Harry Potter and the Sorcerer's Stone (Book 1)      5629932.0
1   1643                                           Twilight      4367341.0
2   3741               The Hobbit, Or, There and Back Again      2364968.0
3   5898                                    Angels & Demons      2279854.0
4   2710  Harry Potter and the Prisoner of Azkaban (Book 3)      2149872.0
5   2661   Harry Potter and the Chamber of Secrets (Book 2)      2115562.0
6   3745                         The Fellowship of the Ring      2009749.0
7   2676  Harry Potter and the Order of the Phoenix (Boo...      1996446.0
8   2723    Harry Potter and the Half-Blood Prince (Book 6)      1944099.0
9    738                                  Lord of the Flies      1861140.0

### authors

In [164]:
# top 10 autores mejor calificados
df.groupby('authors')['average_rating'].mean().sort_values(ascending=False).head(10).reset_index()

                                authors  average_rating
0            James E. Ingram;Lori Grove            5.00
1                          John Diamond            5.00
2                     Robert McL Wilson            5.00
3                      Sara Barton-Wood            5.00
4  Middlesex Borough Heritage Committee            5.00
5              Christopher J. H. Wright            5.00
6                Christopher D. Jiggins            5.00
7              Katie Elliott;Ian Martin            5.00
8                         Keith Donohue            5.00
9                       Simon Cleveland            4.91

In [143]:
# Top 10 authores mas votados
df.groupby('authors')['ratings_count'].sum().sort_values(ascending=False).head(10).reset_index()

                     authors  ratings_count
0              Rowling, J.K.    13835911.00
1            Stephenie Meyer     4367341.00
2        William Shakespeare     4165539.45
3                  Dan Brown     3890172.00
4  John Ronald Reuel Tolkien     3071284.09
5               Stephen King     2508414.00
6               John Grisham     2203924.00
7                 Lois Lowry     2082321.00
8           J. R. R. Tolkien     2015141.00
9               Paulo Coelho     1988186.00

### catagories

In [158]:
# Categorias mejor calificadas

df.groupby('categories')['average_rating'].mean().sort_values(ascending=False).head(10).reset_index()

                                          categories  average_rating
0                                     Spiritual life            5.00
1                                          Botanique            5.00
2                                     Existentialism            4.91
3                         Imaginary wars and battles            4.59
4  Characters and characteristics in motion pictures            4.54
5                               Argentine literature            4.54
6                                        Mississippi            4.54
7                                            Costume            4.52
8                                            Zoology            4.52
9                Chrestomanci (Fictitious character)            4.50

In [144]:
# Categorias mas votadas
df.groupby('categories')['ratings_count'].sum().sort_values(ascending=False).head(10).reset_index()

                  categories  ratings_count
0                    Fiction    72163710.35
1           Juvenile Fiction    28343040.09
2  Biography & Autobiography     7010497.18
3        Young Adult Fiction     4809250.27
4                      Drama     3971985.45
5        Art museum curators     1588890.00
6        Juvenile Nonfiction     1348034.00
7    Comics & Graphic Novels     1267839.00
8                    History     1065858.09
9                       Boys      911582.00

### year

In [151]:
df.groupby('year')['ratings_count'].sum().sort_values(ascending=False).head(10).reset_index()

   year  ratings_count
0  2006    26477947.36
1  2003    18175981.00
2  2015    13835911.00
3  2005    11695808.27
4  2002     9842511.27
5  2004     9246200.18
6  2001     8567379.18
7  1998     7923149.18
8  2007     5567789.09
9  1999     5087745.18